In [1]:
import pandas as pd

In [7]:
data = pd.read_excel("C:\\Users\\Anjali\\Downloads\\titanic3.xls")
data.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [30]:
df = data.copy()
df.describe()
df.isnull().sum()

pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [31]:
# removing useless columns
del df['name']
del df['fare']
del df['ticket']
df.head()

,pclass,survived,sex,age,sibsp,parch,cabin,embarked,boat,body,home.dest
0,1,1,female,29.0000,0,0,B5,S,2,NaN,"St Louis, MO"
1,1,1,male,0.9167,1,2,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,female,2.0000,1,2,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,male,30.0000,1,2,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,female,25.0000,1,2,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [32]:
# filling null entries
df.body.fillna(df.body.mean(), inplace = True)
df.head()

,pclass,survived,sex,age,sibsp,parch,cabin,embarked,boat,body,home.dest
0,1,1,female,29.0000,0,0,B5,S,2,160.809917,"St Louis, MO"
1,1,1,male,0.9167,1,2,C22 C26,S,11,160.809917,"Montreal, PQ / Chesterville, ON"
2,1,0,female,2.0000,1,2,C22 C26,S,NaN,160.809917,"Montreal, PQ / Chesterville, ON"
3,1,0,male,30.0000,1,2,C22 C26,S,NaN,135.000000,"Montreal, PQ / Chesterville, ON"
4,1,0,female,25.0000,1,2,C22 C26,S,NaN,160.809917,"Montreal, PQ / Chesterville, ON"

In [33]:
# percentage of people who survived in the titanic
df['survived'].mean()

0.3819709702062643

In [34]:
# mean age of people travelling in titanic
df['age'].mean()

29.8811345124283

In [37]:
a = df[df.survived == 1]
print(a.shape[0], end=" ")
print("people survived out of", end=" ")
print(df.shape[0])

500 people survived out of 1309

In [42]:
# number of males in titanic who survived
a = df[df.survived == 1]
c = a[a.sex == 'male'].shape[0]
print("No of males who survived :", c)

# number of females in titanic who survived
c = a[a.sex == 'female'].shape[0]
print("No of females who survived :", c)

No of males who survived : 161
No of females who survived : 339

In [47]:
a = df[df.survived == 1]
c = a[a.sex == 'male']
c.age.fillna(c.age.mean(), inplace = True)
c.head()
c.isnull().sum()

C:\Users\Anjali\Anaconda3\lib\site-packages\pandas\core\generic.py:5430: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._update_inplace(new_data)

pclass         0
survived       0
sex            0
age            0
sibsp          0
parch          0
cabin        101
embarked       0
boat           2
body           0
home.dest     55
dtype: int64